app/controllers/order_statuses_controller.rb

SELECT "order_statuses".* FROM "order_statuses"
---
  def index
    @order_statuses = OrderStatus.all