app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
SELECT "delivery_dates".* FROM "delivery_dates" WHERE "delivery_dates"."date" = $1 LIMIT $2  [["date", "2020-10-10"], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."delivery_date_id" = $1 LIMIT $2  [["delivery_date_id", 1], ["LIMIT", 1]]
---
  def index
    if params[:date].nil?
      @orders = Order.all
      json_response(@orders)

    else
      @date = params[:date]
      @idDate = DeliveryDate.find_by(date: @date).id
      @orders = Order.find_by(delivery_date_id: @idDate)

INSERT INTO "orders" ("amount", "user_id", "payment_status_id", "order_status_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount", 4543.23], ["user_id", 14], ["payment_status_id", 7], ["order_status_id", 9], ["created_at", "2021-02-12 13:02:15.834797"], ["updated_at", "2021-02-12 13:02:15.834797"]]
---
  def create
    @order = Order.create!(order_params)

SELECT "payment_statuses".* FROM "payment_statuses" WHERE "payment_statuses"."status" = $1 LIMIT $2  [["status", "Pagada"], ["LIMIT", 1]]
INSERT INTO "payment_dates" ("date", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["date", "2021-02-11"], ["created_at", "2021-02-11 16:08:28.303300"], ["updated_at", "2021-02-11 16:08:28.303300"]]
SELECT "order_statuses".* FROM "order_statuses" WHERE "order_statuses"."status" = $1 LIMIT $2  [["status", "Entregada"], ["LIMIT", 1]]
INSERT INTO "delivery_dates" ("date", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["date", "2021-02-11"], ["created_at", "2021-02-11 15:56:31.501525"], ["updated_at", "2021-02-11 15:56:31.501525"]]
UPDATE "orders" SET "amount" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["amount", 66666.0], ["updated_at", "2021-02-12 13:02:53.190367"], ["id", 42]]
---
  def update
    if params[:payment_status_id].to_i == PaymentStatus.find_by(status: 'Pagada').id
      @date = PaymentDate.create(date: Time.now)
      @order.payment_date_id = @date.id
    end

    if params[:order_status_id].to_i == OrderStatus.find_by(status: 'Entregada').id
      @date = DeliveryDate.create(date: Time.now)
      @order.delivery_date_id = @date.id
    end
    @order.update(order_params)

DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 42]]
---
  def destroy
    @order.destroy

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def set_order
    @order = Order.find(params[:id])