app/controllers/payment_statuses_controller.rb

SELECT "payment_statuses".* FROM "payment_statuses"
---
  def index
    @payment_statuses = PaymentStatus.all