app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.create!(user_params)
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Test Test"], ["email", "test@gmail.com"], ["created_at", "2021-02-11 15:35:51.284871"], ["updated_at", "2021-02-11 15:35:51.284871"]]

  def update
    @user.update(user_params)
---
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Luis"], ["email", "test@test.com"], ["updated_at", "2021-02-12 12:48:36.943073"], ["id", 14]]

  def destroy
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 22]]

  def set_user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]